In [2]:
import pandas as pd
import numpy as np

In [48]:
# dct = {"brand": "Ford","model": "Mustang", "year": 1964}
dct = {'a':[1,2,3,1], 'b':[4,5,6,7], 'c':[8,9,10,'11']}

dct_df = pd.DataFrame(dct)
print(type(dct_df))
dct_df

<class 'pandas.core.frame.DataFrame'>

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [5]:
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [6]:
# .columns mainīgajā glabājas df kolonnu nosaukumi
dct_df.columns

Index(['a', 'b', 'c'], dtype='object')

In [7]:
# df var transponēt
dct_df.T

   0  1   2   3
a  1  2   3   1
b  4  5   6   7
c  8  9  10  11

In [ ]:
# Kādu DF atgriezīs nākamās rindiņas atkomentēšana un palaišana?
dct_df

In [9]:
dct_df.sum()
# Kāpēc saskaitīja tikai a un b kolonnas?

a     7
b    22
dtype: int64

In [ ]:
# Uzdevums: 
# Sameklējiet ko dara DataFrame objekta .to_numeric() funkcija

In [21]:
s = dct_df['a']
# print(type(s))

   a   c
0  1   8
1  2   9
2  3  10
3  1  11

In [22]:
# pd.to_numeric(dct_df)


kolonna_c = dct_df['c']

kolonna_c = pd.to_numeric(kolonna_c)
dct_df['c'] = kolonna_c

In [23]:
dct_df.sum()

a     7
b    22
c    38
dtype: int64

In [29]:
# Izmantojot .head() funkciju var apskatīt df pirmos n elementus (pēc noklusējuma n = 20)
dct_df.head()

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [30]:
kolonna = dct_df['a']
print(type(kolonna))

<class 'pandas.core.series.Series'>

In [31]:
kolonna

0    1
1    2
2    3
3    1
Name: a, dtype: int64

In [39]:
series_list = list(kolonna)
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [41]:
series_list

[1, 2, 3, 1]

In [42]:
kolonnas_DF = pd.DataFrame(kolonna)

In [43]:
kolonnas_DF

   a
0  1
1  2
2  3
3  1

In [38]:
kolonna.value_counts()

1    2
3    1
2    1
Name: a, dtype: int64

In [50]:
c_kolonna = dct_df['c']
c_kolonna.value_counts()
c_list = list(c_kolonna)

In [51]:
c_list

[8, 9, 10, '11']

In [53]:
# Pandas dataframe pēc noklusējuma ir indeksēti
rindina = dct_df.loc[1]
print(type(rindina))

<class 'pandas.core.series.Series'>

In [54]:
rindina

a    2
b    5
c    9
Name: 1, dtype: object

In [55]:
manually_indexed_df = pd.DataFrame(dct, index = ['pirma', 'otra', 'tresa', 'ceturta'])

In [56]:
manually_indexed_df

         a  b   c
pirma    1  4   8
otra     2  5   9
tresa    3  6  10
ceturta  1  7  11

In [ ]:
manually_indexed_df

In [57]:
dct_df

   a  b   c
0  1  4   8
1  2  5   9
2  3  6  10
3  1  7  11

In [58]:
# Rindu atlasīšana:
# Vairāki veidi. Viens no tiem: šķelt rindiņas ar būla mainīgo kolonnu
bool_col = [True, True, False, True]
dct_df[bool_col]

   a  b   c
0  1  4   8
1  2  5   9
3  1  7  11

In [60]:
# Rindu atlasīšana:
# Vairāki veidi. Viens no tiem: šķelt rindiņas ar būla mainīgo kolonnu
bool_col = [True, False, True]
dct_df.T[bool_col].T

   a   c
0  1   8
1  2   9
2  3  10
3  1  11

In [ ]:
# Pašā df arī var veidot šķēlumu
# Piemēri:
dct_df[dct_df['a'] == 1]

In [61]:
some_df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

In [62]:
some_df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [ ]:
some_df.filter(items=['one', 'three'])

In [63]:
some_df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [64]:
csv_df = pd.read_csv('airtravel.csv')

In [65]:
csv_df

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [66]:
json_df = pd.read_json('lasams_json_piemers.json')

In [67]:
json_df

                                                    menu
id                                                  file
popup  {'menuitem': [{'value': 'New', 'onclick': 'Cre...
value                                               File

In [68]:
json_pandas_output = json_df.loc['popup']['menu']

In [69]:
print(type(json_pandas_output))
print(json_pandas_output)

<class 'dict'>
{'menuitem': [{'value': 'New', 'onclick': 'CreateNewDoc()'}, {'value': 'Open', 'onclick': 'OpenDoc()'}, {'value': 'Close', 'onclick': 'CloseDoc()'}]}

In [70]:
json_table = pd.DataFrame(json_pandas_output['menuitem'])

In [71]:
json_table

   value         onclick
0    New  CreateNewDoc()
1   Open       OpenDoc()
2  Close      CloseDoc()

In [75]:
sum_res = csv_df.sum()

In [103]:
# Uzdevums: 
# Saskaitiet cik kopā ir bijuši avio pasažieri no 1958. gada līdz 1960. gadam izmantojot no airtravel.csv izveidoto DataFrame
csv_df = pd.read_csv('airtravel.csv')


csv_df.sum(axis=1)

0     1117
1     1051
2     1187
3     1205
4     1255
5     1442
6     1661
7     1670
8     1375
9     1227
10    1062
11    1174
dtype: int64

In [ ]:
# Uzdevums: 
# Atrodiet un ieimportējiet pd DataFrame objektā kādu excel failu, izmantojot pd.read_excel() funkciju
# Izvēlieties kādu excel faila kolonnu un pārbaudiet vai visas vērtības šajā kolonnā ir unikālas. 
pd.read_excel()